# Direct Context 3DHandle Settings Set Color Method

Source: https://www.revitapidocs.com/2026/c57dee26-4a35-2bd6-edf0-8ce1a908ed1a.htm

---

| Direct Context 3DHandle Settings Set Color Method |
| --- |

Sets the color of the handle and the associated DirectContext3D graphics.
**Namespace:** Autodesk.Revit.DB.DirectContext3D
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetColor(
	Color color
)
```

```
Public Sub SetColor (
	color As Color
)
```

```
public:
void SetColor(
	Color^ color
)
```

```
member SetColor :
        color : Color -> unit
```

#### Parameters

color Color
:   The color to apply.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

DirectContext3DHandleSettings Class Autodesk.Revit.DB.DirectContext3D Namespace